[
  {
    "title": "10.5m Whangamata Marina Berth",
    "ok": true,
    "info": "boatName: 10.5m Whangamata Marina Berth\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: Grab this 10.5m Whangamata Marina Berth for your vessel and spen the time cruising this wonderful part of New Zealand\nBoatCode: WHB20-PO"
  },
  {
    "title": "10m Power Cat",
    "ok": true,
    "info": "boatName: 10m Power Cat\nLocation: Bay of Plenty\nBroker: Matthew Woodman\nLong Description: Wakarua is a very well-maintained, custom built Aluminum Catamaran, built by Alloy Cats, in Mt Maunganui. She has only ever been used in fresh water, on Lake Tarawera. Wakarua has twin 130hp Evinrude Etec Engines, which were fitted as an upgrade in 2016, having had minimal use in salt water. The twin engines provide efficiency, security, and manoeuvrability. A full diagnostic engine report was performed on 26 Feb 2022, showing zero faults, and is available upon request. Wakarua was built and used for an owner/operator private charter and was surveyed for 30 PAX plus 4 crew but has been out of survey for the past 4 years and is reluctantly for sale due to health issues.\nBoatCode: AC-MW"
  },
  {
    "title": "11.5m Powercat",
    "ok": true,
    "info": "boatName: 11.5m Powercat\nLocation: Auckland\nBroker: Ed Griffin\nLong Description: This 34ft Powercat has the stability a twin hulled vessel with a beam of 3.5m and a draft .8m’s provides. The current owner has owned \"Kitkat\" for nearly 9 years, and she is in regular use. Repowered 6 years ago with a pair of Volvo D4-260's, these have proved reliable and very easy to maintain. She has a pair of Levi Surface Drives and is capable of 28 knots. Her economical cruising speed with a clean bottom is 18 to 20 knots. Mechanically she is in pretty good condition, and I would have no hesitation in taking her out for an extended trip.\nShe is fully equipped with twin fuel tanks of 350 litres each giving her a range of nearly 200 nautical miles .\nShe has a 120-litre freshwater tank, and a holding tank. This is a great platform and would fit a 12m marina berth perfectly.\nBoatCode: KIT-EG"
  },
  {
    "title": "12m Tutukaka Pile Mooring",
    "ok": false,
    "info": "boatName: 12m Tutukaka Pile Mooring\nLocation: Whangarei\nBroker: Mike Parker\nLong Description: Gateway to Poor Knights and the far North\nTutukaka Marina has excellent onshore facilities all within walking distance.\nThese include shops, restaurants, hotel, deep sea anglers club, dive fills, 24hr diesel & 95 fuel jetty.\nTutukaka is close to popular deep sea fishing areas and the renowned Poor Knights Marine Reserve for outstanding scuba diving and nearby sunken wrecks.\nBoatCode: TUT-12"
  },
  {
    "title": "12m Whangaroa Marina Berth",
    "ok": false,
    "info": "boatName: 12m Whangaroa Marina Berth\nLocation: Whangaroa\nBroker: Mike Parker\nLong Description: 12m Marina Berth A9 for sale in the picturesque Whangaroa Harbour Marina. These berths don't come up very often.  Lease expires in 2050.\nContact Mike on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: WhangMB-MP"
  },
  {
    "title": "13m Lidgard Bridge Deck Motor Launch",
    "ok": false,
    "info": "boatName: 13m Lidgard Bridge Deck Motor Launch\nLocation: Mangonui\nBroker: Mike Parker\nLong Description: Introducing the epitome of old-world charm, and luxury on water - the 43ft Lidgard Bridge Deck Motor Launch. Crafted with meticulous attention to detail, this vessel represents the pinnacle of maritime sophistication.\nStep aboard and be greeted by a world of refined elegance. The Lidgard Bridge Deck Motor Launch boasts a timeless design that seamlessly blends classic lines with modern amenities. Every inch of this vessel exudes luxury.\nEnjoy commanding views from the bridge deck, where you can helm the vessel with ease or simply relax and soak in the beauty of your surroundings. Whether you're navigating coastal waters or cruising along open seas, the bridge deck offers the perfect vantage point for your journey.\nBuilt to the highest standards of craftsmanship and quality, the 43ft Lidgard Motor Launch is a testament to decades of expertise and innovation. Every detail reflects a commitment to excellence that is unparalleled in the industry.\nEmbark on a journey of unparalleled luxury and adventure with the 43ft Lidgard Bridge Deck Motor Launch. Elevate your seafaring experience and make every voyage an unforgettable masterpiece of style, comfort, and performance.\nContact Mike on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: LBDML-MP"
  },
  {
    "title": "14m Ron Given Catamaran",
    "ok": false,
    "info": "boatName: 14m Ron Given Catamaran\nLocation: Auckland\nBroker: Flynn Hart\nLong Description: A beautiful sea-worthy vessel, designed by the legendary kiwi Ron Given and built by NZ boat-builder Neil Strong. Master blaster is safe, strong, and fast - A Kiwi icon of the sea. Master Blaster has been thoughtfully designed to utilise every inch of space. At 6.5m beam, the interior contains 6 cabins, comfortably sleeping 10 people, a full galley that would rival a domestic kitchen, massive saloon and dining area, head with shower and of course ample storage. The exterior Aft boasts a large and comfortable cockpit making Master Blaster a great cruiser for entertaining. Additionally, there is a wooden deck which serves as a swimming platform, fishing and trawling station, outdoor shower and BBQing. The bow of the vessel has the signature catamaran tramps but unlike others, Master Blaster has a wooden deck for relaxing and entertaining - another example of optimised space. Master Blaster is simple to operate and navigate. All lines come back to the sheltered helm. Both the head sail and main sail are on furlers making it super easy to raise, return and trim sails with the automatic winch. Next to the steering wheel is a brand-new navigation station, kitted out with Garmin chart plotter, instrument displays, VHF radio and autopilot. This gives accurate and real-time data, making your voyage safe and stress-free. Master Blaster has two 35HP Stern drive engines. The engine with the most hours has done no more than 1400. Engines start first time every time, have been well maintained, with a lot of life left in them. Master Blaster is GOP - an extremely strong and safe way to build a boat. Launched in 1978, she has been completely refitted and upgraded to bring her up to spec with any modern-day catamaran.\"\nBoatCode: RG14-FH"
  },
  {
    "title": "14m Tutukaka Pile Mooring",
    "ok": false,
    "info": "boatName: 14m Tutukaka Pile Mooring\nLocation: Whangarei\nBroker: Mike Parker\nLong Description: Gateway to Poor Knights and the far North\nTutukaka Marina has excellent onshore facilities all within walking distance.\nThese include shops, restaurants, hotel, deep sea anglers club, dive fills, 24hr diesel & 95 fuel jetty.\nTutukaka is close to popular deep sea fishing areas and the renowned Poor Knights Marine Reserve for outstanding scuba diving and nearby sunken wrecks.\nBoatCode: TUT-14"
  },
  {
    "title": "1894 Logan Cutter",
    "ok": false,
    "info": "boatName: 1894 Logan Cutter\nLocation: Lyttleton\nBroker: Ashleigh Macdonald\nLong Description: YVONNE\nThis is no ordinary sailing vessel; Yvonne is an 1894 Cutter designed and built by the Logan Brothers.\nThis LADY is steeped in maritime history. She was launched in 1894 and boasts tales from her days of coastal racing.\nOne such tale tells of the 1909 Christmas Eve race, the weather turned sour, and Yvonne leapt across the Moles at the entrance to Dunedin harbor! The original logbook by Professor RJ Scott will be passed on to the new custodian.\nYvonne has been very well maintained and upgraded and is a strong sturdy vessel; she needs to be seen to be appreciated. So if you would like the opportunity to own a piece of New Zealand’s maritime history, then this is your chance. Contact our vendors sole agent Ashleigh on 0273263486 or email ashleigh@parkermarinegroup.co.nz\nBoatCode: YV-AM"
  },
  {
    "title": "1960 Levi Corsair Sportfisher",
    "ok": false,
    "info": "boatName: 1960 Levi Corsair Sportfisher\nLocation: Opua\nBroker: Mike Parker\nLong Description: This 1960 Levi Corsair is a warm, comfortable vessel, fitted out to live aboard comfortably. She has had thousands spent on her to make her a special place to be. Not only is she a comfortable vessel, she is also a fully equiped sportfisher with game chair and outriggers. Great fishing cockpit and the power of twin 210hp Cummins diesel engines. Her current owners have relocated to Perth in Western Australia, so this is your opportunity to buy their special lady.\nContact Mike on 0275504140 or email mike@parkermarinegroup.co.nz \nBoatCode: LC14-JW"
  },
  {
    "title": "1972 Oliver & Gilpin ",
    "ok": false,
    "info": "boatName: 1972 Oliver & Gilpin \nLocation: Whangaroa\nBroker: Mike Parker\nLong Description: PRICE REDUCED BY $26,000\nLike all precious Gemstones, Sapphire is a polished example of these classic Oliver Gilpin Sportfishers.\nShe has just undergone an 8-month refit and repaint, with new carpet, galley flooring, varnish work, etc, etc.\nThis beautiful vessel is now for sale, and I am extremely proud to be presenting her to the market for the first time in 20 years. Powered by twin 90hp Ford Dover diesels, she cruises all day at 8 knots and if you’re in a hurry, you can push her to 11 knots. Don’t miss this opportunity to own a real New Zealand designed and built classic.\nPlease contact the Vendors Sole Agent, Mike Parker on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: OG48-MP"
  },
  {
    "title": "1974 Pelin Shikaree",
    "ok": false,
    "info": "boatName: 1974 Pelin Shikaree\nLocation: Tutukaka\nBroker: Mike Parker\nLong Description: Are you looking for a vessel with a reputation for catching fish – “Outa Here” is that boat.\n No pretence or frilly bits here. She is a fishing vessel that can sleep up to 8 people in comfort and provide all the things needed for a nice stay onboard. Outa Here was launched in 1974 and has been maintained by her well-known current owner for years, but the time has come to hang up his skipper’s hat and pass the helm to another skipper who will continue to put her through her paces, and care for her as she will care for them.\nContact our vendors Sole Agent Mike Parker on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: PS74-MP"
  },
  {
    "title": "1975 Jack Brooks Motor Sailor",
    "ok": false,
    "info": "boatName: 1975 Jack Brooks Motor Sailor\nLocation: Christchurch\nBroker: Ashleigh Macdonald\nLong Description: The ultimate family cruiser- Chia. She has been lovingly cared for and maintained by her owner for the past 20 years but family growing up and moving away has meant it’s time for a change. Don’t miss the opportunity to own this spacious, sea kindly vessel. Designed by John Brooks and launched in 1975, she has had most of her upgrades done- The powerful 65hp Ford was completely re-conditioned 350 hours ago, exterior was repainted last summer including the removal of all deck fittings, cleaned up and re-sealed, windows resealed 1 year ago.\nUnderway she sails beautifully and can readily reach 7 knots. If you’re looking for a vessel with space for the whole family- Chia is the one! She has a fantastic layout, she has a spacious aft cabin with a large double berth, full headroom shower and plenty of storage, 2 single berths in the saloon along with a table that converts to an artist’s easel and an inside helm, forward of this is her fully equipped galley to port, and electric head to starboard. There is a single berth which runs under the saloon here, then a double ‘v’ berth up forward. The cockpit is super roomy, with tiller steering and a walk-through transom with a swimming platform.\nContact our Vendors Sole Agent, Ashleigh, on 0273263486 or email her ashleigh@parkermarinegroup.co.nz\nBoatCode: CHIA-AM"
  },
  {
    "title": "1976 Sparkman & Stephens APLA",
    "ok": false,
    "info": "boatName: 1976 Sparkman & Stephens APLA\nLocation: Warkworth\nBroker: Flynn Hart\nLong Description: The Sparkman & Stephens designed ALPA 11.5m sailboat, built in 1976, is a classic cruiser known for its graceful lines and seaworthiness. The ALPA 11.5m was designed by the renowned naval architecture firm Sparkman & Stephens, known for their elegant and efficient designs. The boat typically features a sleek and classic profile with moderate overhangs and a graceful sheer line. Most likely constructed using traditional methods of fiberglass construction prevalent during that era, with a reinforced hull and deck for durability and seaworthiness. The sail plan of the ALPA 11.5m typically includes a sloop rig configuration with a main sail and a headsail (genoa or jib). This setup provides versatility and ease of handling for both cruising and racing. Below deck, the ALPA 11.5m likely offers comfortable accommodations suitable for extended cruising or weekend getaways. This might include a forward cabin, main saloon with seating and dining area, galley (kitchen), head (bathroom), and possibly additional berths for guests. While not necessarily designed for racing, the ALPA 11.5m likely offers good performance under sail, thanks to its efficient hull shape and well-balanced design. It should handle a variety of sea conditions with stability and agility. The deck layout of the ALPA 11.5m probably features a spacious cockpit for comfortable sailing and socializing, with ergonomic cockpit seating and easily accessible sail controls. The deck hardware such as winches, cleats, and tracks are likely strategically placed for efficient sail handling.\nBeing designed in the mid-1970s, the ALPA 11.5m may embody classic design elements typical of sailboats from that era, such as teak trim, bronze hardware, and a traditional interior layout with wood finishes. Sparkman & Stephens designs are known for their seaworthiness, and the ALPA 11.5m should be no exception. Its sturdy construction and well-balanced design should inspire confidence in offshore passages or coastal cruising.\nContact Flynn Hart on 02108594195 or email flynn@parkermarinegroup.co.nz\nBoatCode: SSA-FH"
  },
  {
    "title": "1978 Farr 38",
    "ok": false,
    "info": "boatName: 1978 Farr 38\nLocation: Kerikeri\nBroker: Mike Parker\nLong Description: The Farr38 is one of Bruce Farr's masterpieces, and Angstrom is one of the finest examples of this design you will find in New Zealand, indeed she has been maintained and upgraded by her owners, with the most recent refit being done in 2018. These popular Bruce Farr designs were built by many, but ANGSTROM, was built by Don Senior and anyone who knows anything about boats knows that Don’s builds, are among the best in the world. Her paintwork is flawless, and the leather upholstery adds to the luxurious feel below decks and makes her the perfect fast cruising vessel for the discerning buyer.\nLet me tell you why this vessel is your ticket to an unforgettable journey on the high seas:\nLegendary Design: Crafted by the renowned yacht designer Bruce Farr, the Farr 38’s sleek lines and graceful profile turn heads in every harbour.\nBuilt to Last: Built by Don Senior in 1978, this yacht boasts durability and reliability that stands the test of time. Quality materials and Don’s expert craftsmanship ensure this to be true.\nExceptional Performance: Whether you're racing against the wind or cruising leisurely, the Farr 38 delivers unparalleled performance. Its responsive handling and impressive speed make every voyage exhilarating.\nSpacious Interior: Step below deck and discover a world of comfort and elegance. The interior of the Farr 38 is thoughtfully designed for relaxation and entertainment, with ample space for lounging, dining, and sleeping.\nIt might just be the most PERFECT cruising yacht, ever designed.\nWell-Equipped: Equipped with all the amenities you need for extended voyages, this yacht features a well-appointed galley, and cozy berths. She is quite literally, your home away from home on the open water.\nTimeless Style: From its classic teak accents to its sleek hull, the Farr 38 exudes timeless style and sophistication. Whether you're enjoying a sunset cruise or competing in a regatta, you'll do so in impeccable fashion.\nDon't miss your chance to own a piece of sailing history! The 1978 Farr 38 is more than just a vessel—it's a symbol of adventure, luxury, and enduring craftsmanship. Seize the opportunity to embark on unforgettable voyages and create lifelong memories with family and friends.\nContact Mike today on 0275504140 or email mike@parkermarinegroup.co.nz for more information.\nBoatCode: ANG-MP"
  },
  {
    "title": "1978 Lidgard Dorado",
    "ok": false,
    "info": "boatName: 1978 Lidgard Dorado\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: The 1978 Lidgard Dorado is a classic NZ launch that embodies the renowned craftsmanship and design expertise of the Lidgard family, a name synonymous with excellence in New Zealand boatbuilding. Designed with both functionality and style in mind, this vessel offers a timeless appeal for boating enthusiasts who value quality and performance. Whether you're looking for a vessel for family outings, fishing adventures, or leisurely coastal cruises, the 1978 Lidgard Dorado is a testament to classic Kiwi boatbuilding tradition. Its timeless design and dependable performance make it a cherished addition to any boater's collection.\nDorado has recently had prop speed and antifoul applied, along with a full engine service, so she is all ready for family fun and adventure.\nContact Mike on 0275504140 or email mike@parkermarinegroup.co.nz \nBoatCode: DOR-PO"
  },
  {
    "title": "1978 Pelin Shikaree",
    "ok": false,
    "info": "boatName: 1978 Pelin Shikaree\nLocation: Tutukaka\nBroker: Mike Parker\nLong Description: Step aboard Vagrant, a stunning 1978 13.5m Pelin Shikaree flybridge launch, built for serious cruising and comfortable living. This meticulously maintained vessel is a true testament to classic Kiwi craftsmanship, combining the reliability of a robust design with modern refinements that ensure smooth and efficient passage. Powered by a 320hp Caterpillar 3208 diesel engine, Vagrant cruises effortlessly at 12 knots, offering both economy and performance for extended adventures. With a spacious flybridge, commanding views, and well-thought-out helm stations, she provides an unbeatable experience whether you're navigating New Zealand’s coastline or relaxing at anchor. Inside, her immaculate condition speaks for itself. Designed for both entertaining and overnight stays, Vagrant comfortably sleeps up to 10, making her ideal for family getaways, fishing trips, or coastal cruising with friends. A well-equipped galley, generous saloon, and ample storage ensure a seamless onboard experience. Whether you're looking for a proven coastal cruiser, a dependable liveaboard, or a vessel with character and capability, Vagrant delivers on all fronts. Don’t miss your chance to own this exceptional classic—she’s ready for her next adventure. Contact us today to arrange a viewing and experience Vagrant firsthand! Phone Mike on 0275504140or email mike@parkermarinegroup.co.nz\nBoatCode: VAG-MP"
  },
  {
    "title": "1978 Young 43",
    "ok": false,
    "info": "boatName: 1978 Young 43\nLocation: Whangaroa\nBroker: Mike Parker\nLong Description: Cherished by her owner, for 27 years, she is now awaiting new sailing adventures.\nThe Young 43 is equally at home cruising the coast or taking on the challenge that is Blue Water sailing.\nAccommodation is available for up to eight with a private double cabin aft with ensuite and an additional head forward to cater for guests. Powered by an ever reliable 70hp Ford diesel engine, she will slip through the water at 7 knots all day long if required. She has a stylish solid dodger that not only looks great, but it is also completely functional, keeping all those onboard warm, and dry in the toughest conditions. Contact Mike on 0275504140 or email mike@parkermarinegroup.co.nz \nBoatCode: LOTO-MP"
  },
  {
    "title": "1979 Mk1 Bertram 35",
    "ok": false,
    "info": "boatName: 1979 Mk1 Bertram 35\nLocation: Picton\nBroker: Dave Radford\nLong Description: The 1979 Mk1 Bertram 35 is widely considered a classic, well-built sportfishing boat with excellent seakeeping abilities, a spacious cockpit, and a layout suitable for both serious fishing and family cruising. They are known for their smooth ride, precise handling, and strong performance, while still maintaining a stylish design with quality finishes.\nPowered by twin Cummins 6BTA 5.9. Repowered in 2008.\nMolded Fiberglass Construction. Solid Fiberglass Deep Vee Hull. 19 Degrees Deadrise at transom\nLayout is classic 35’ Bertram one stateroom, one head, galley-up layout. Forward stateroom with large double Vee berth with custom mattress. Head with stall shower and vanity with storage. L-shaped galley to port. Lower helm to starboard. Full size sofa bed. Galley includes 115v Princess 3 burner electric stove with and Sharp microwave oven. For more information or to book a viewing, please contact Dave Radford Phone: 0272577071 Email: dave@parkermarinegroup.co.nz\nBoatCode: RUN-DR"
  },
  {
    "title": "1979 Nova 28",
    "ok": false,
    "info": "boatName: 1979 Nova 28\nLocation: Lyttleton\nBroker: Ashleigh Macdonald\nLong Description: Alan Wright Nova 28, Long Black, was launched in 1979, fiberglass hull, fin keel and powered by a 17 Hp Lombardini. Long Black has been well cared for and had many upgrades in 2020, including a full professional re-paint of the entire boat, re-wire of the mast and the rigging re-tuned. A composting toilet has been installed- and never used! With 5 berths and the option of dropping the table to make a 6th, Long Black can fit the whole family!\nShe is a very tidy vessel and priced to sell - will make a great harbour and coastal cruiser, and with fresh antifoul in March- She is ready to go!\nContact our Vendors Agent, Ashleigh, on 0273263486 or email her ashleigh@parkermarinegroup.co.nz\nBoatCode: LB-AM"
  },
  {
    "title": "1980 Pelin 32-Semi Commercial",
    "ok": false,
    "info": "boatName: 1980 Pelin 32-Semi Commercial\nLocation: Tauranga\nBroker: Paul Oldham\nLong Description: This 1980 Semi-Commercial Pelin 32 is a tidy vessel with completely covered cockpit area to keep out of the New Zealand sun. She has both cockpit and saloon helm controls, and the cockpit is a large and open workspace. She would be a great day fisher or overnighter for 4 people. Powered by a 300hp Cummins 6BTA she cruises at 17 knots and tops out at 22 knots. She also has a HUGE boarding platform which makes for ample fishing room.\nContact Paul Oldham on 0274991028 or email paul.o@parkermarinegroup.co.nz\nBoatCode: TH-PO"
  },
  {
    "title": "1980 Raven 38",
    "ok": false,
    "info": "boatName: 1980 Raven 38\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: Sail with Distinction – The Raven 38 by Owen Wolley\nStep aboard the Raven 38, a masterclass in performance cruising and elegant design by renowned naval architect Owen Wolley. This finely crafted sailing yacht combines race-bred responsiveness with offshore comfort, making her as comfortable on a spirited coastal sprint as she is on a long blue water passage.\nWith her sleek lines, well-balanced hull, and finely tuned sail plan, the Raven 38 delivers exhilarating performance under sail without compromising safety or stability. Her spacious cockpit and ergonomic deck layout are designed for easy handling, whether you're racing with a full crew or cruising short-handed.\nBelow deck, the Raven 38 offers a warm, inviting interior with rich wood finishes, generous natural light, and clever use of space. The saloon is ideal for entertaining or relaxing after a day on the water, while the well-appointed galley, private cabins, and ample storage reflect a thoughtful, liveaboard-ready design.\nWhether you're chasing the wind or chasing the horizon, the Raven 38 invites you to experience sailing at its finest. Designed with passion, built with precision, this is a yacht that inspires confidence, turns heads, and rewards every nautical mile. Contact our vendors Sole Agent, Paul Oldham on 0274991028 or email paul.o@parkermarinegroup.co.nz\nBoatCode: R38-PO"
  },
  {
    "title": "1980 Salthouse 48 ",
    "ok": false,
    "info": "boatName: 1980 Salthouse 48 \nLocation: Bay Of Plenty\nBroker: Paul Oldham\nLong Description: Solan is a Salthouse 48, and she shows the pedigree that Bob Salthouse brought to her design and build.\nShe is an extremely capable Bluewater vessel, and it is believed that she would go into Cat 1 very readily.\nBuilt to be incredibly strong in 3 skinned, cold molded kauri, which gives her a hull thickness of 32mm, she really is a go anywhere vessel. For more information, or to schedule a viewing of this lovely yacht, please contact Hamish Revfem on\n0274991028 or email paul.o@parkermarinegroup.co.nz\nBoatCode: SH48-PO"
  },
  {
    "title": "1982 Pacific 38",
    "ok": false,
    "info": "boatName: 1982 Pacific 38\nLocation: Wellington\nBroker: Aaron Bilham\nLong Description: Strong, sturdy and beautiful- If you’re looking for a comfortable cruiser to keep you and the whole family safe, come and have a look at this Allen Smith designed and built Pacific 38. She has beautiful lines that reflect her pedigree.\nThe beautiful classic line, narrow hull and overhanging bow and counter stern with pinched ends screams perfection.\nThe solid build and capable fin and skeg rudder hull design make her a very good offshore vessel.\nPerformance is what you would expect for a vessel of that era and style.\nDon’t miss your opportunity to own this quality hand crafted vessel.\nContact Aaron on 0224245426 or email aaron@parkermarinegroup.co.nz\nBoatCode: FS-AB"
  },
  {
    "title": "1982 Passage Maker",
    "ok": false,
    "info": "boatName: 1982 Passage Maker\nLocation: Australia\nBroker: Mike Parker\nLong Description: Thalassa is a canoe stern ex fishing vessel, designed by Geoff Thyer based on the famous North Sea Trawlers.\nShe was built by Mick Drake and was first launched in 1982 and worked as a cray boat on the West Coast of Tasmania.\nShe was sold in 2011 and Graeme \"Frizzle\" Freeman undertook a complete refit & restoration.\nThe wet well was removed, and the wheelhouse was extended. She is fitted with Naiad Dynamics Multisea II hydraulic stabilizers which make her a fantastic long range cruising boat, and she has cruised Tasmania, New Caledonia, Fiji, Vanuatu, Tonga & New Zealand. This boat is well constructed and exceptionally strong, so if you are looking for an incredible offshore Passage Maker, look no further than this fantastic vessel.\nContact Mike, the vendors Sole Agent, on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: THAL-MP"
  },
  {
    "title": "1982 Samantha 39 MkII Ketch",
    "ok": false,
    "info": "boatName: 1982 Samantha 39 MkII Ketch\nLocation: Napier\nBroker: Aaron Bilham\nLong Description: Wemoon (Celtic name for stars and galaxy)\nWemoon is a Samatha 39 Mk II ketch. She is a very capable, offshore center cockpit vessel, and is in very tidy condition. The yacht has been built to a very high standard. All furniture is hand built of solid African oak. Wemoon had a professional osmosis repair to hull just last year.\nAccommodating layout with Fore cabin and head, with comfortable double berth and an Aft cabin and head with a large double berth, providing a total of 6 berths\nContact our vendors sole agent, Aaron Bilham on 0224245426 or email aaron@parkermarinegroup.co.nz\nBoatCode: WEM-AB"
  },
  {
    "title": "1983 Irwin Haag Sea Harvester",
    "ok": false,
    "info": "boatName: 1983 Irwin Haag Sea Harvester\nLocation: Mangonui\nBroker: Mike Parker\nLong Description: JAY VEE comes off the drawing board of renowned Naval Architect, Irwin Haag. A prolific designer with a reputation for quality steel workboats. Jay Vee is no exception and was built in 1983 by Hank Oosterbrook, whose work was always considered the very best when it came to building steel vessels. Jay Vee is powered by a very economical 90hp Fordson Diesel engine, and she cruises all day long at 7 knots, using around 5ltrs/hour and with 700ltrs of diesel in her tanks her range would be approximately 980 NM. She has berths for 4 people and comfortable interior.\nContact our vendors Sole Agent, Mike on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: JV-MP"
  },
  {
    "title": "1986 14m Pelin Columbia",
    "ok": false,
    "info": "boatName: 1986 14m Pelin Columbia\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: Experience Classic Fishing Excellence: The 1986 Pelin Columbia!\nStep into a timeless adventure with this 1986 Pelin Columbia – a true legend in the boating world! This boat is the perfect choice for anglers and boating enthusiasts who appreciate quality and classic design.\nDon't Miss Out on This Classic Catch!\nThere’s nothing like the feeling of a tried-and-true classic beneath your feet as you head out for a day of fishing and adventure. Contact us today to learn more and schedule a viewing.\nThe fish are biting, and your perfect boat is waiting!\nContact our Sole Agent, Paul Oldham to arrange a viewing of Aquila - 0274991028 or email paul.o@parkermarinegroup.co.nz\nBoatCode: PC14-PO"
  },
  {
    "title": "1986 Formula 4000",
    "ok": false,
    "info": "boatName: 1986 Formula 4000\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: Introducing the 1986 Formula 4000 – EXPRESSION\nThe Formula 4000 is a very highly regarded vessel from the drafting board of Jim Young.\nExpression is no exception to this rule and presents very well.\nShe is turnkey ready for summer cruising and is big enough for the entire family with 2 x Doubles, 2 x single bunks and the salon seating can be used as berths if required.\nTo schedule a viewing of this vessel, please call/text Paul Oldham on 0274991028or you can email paul.o@parkermarinegroup.co.nz\nBoatCode: EXP-PO"
  },
  {
    "title": "1986 Laurie Davidson 40",
    "ok": false,
    "info": "boatName: 1986 Laurie Davidson 40\nLocation: Auckland\nBroker: Flynn Hart\nLong Description: Quote \"The America's Cup pitches boat against boat, sailor against sailor, but I also liked it for the fact it was also a contest between designers\" Laurie Davidson.\nOf course, Davidson was one of the best. He emerged out of an era of extremely talented New Zealand designers and helped Team New Zealand firstly win the America's Cup in 1995 and then defend it in 2000. This Davidson designed 12m yacht is a fast and comfortable cruiser and she shows Laurie's design flair everywhere. Contact Flynn on 02108594195 or email him flynn@parkermarinegroup.co.nz today, and grab a Kiwi Icon at a great price.\nBoatCode: LD-FH"
  },
  {
    "title": "1986 Markline 900",
    "ok": false,
    "info": "boatName: 1986 Markline 900\nLocation: Auckland\nBroker: Ian Duncan\nLong Description: 1986 Markline 900 - Vendors want sold! Mercruiser 220HP turbo diesel engine with a Bravo 2 leg. The hour meter shows 1,530 hours, but the engine has only done 350 hours since a full re-condition of motor which cost $30,000 (receipts available). The cruising speed is 14 knots (at 20 ltrs of fuel per hour) and a max speed of 18 knots.\nThe Master cabin up front with infill V double. Dinette table in the salon converts to make another double and the seating to starboard convert to a set of pullman bunks. Flybridge with two loungers. Two showers, one in the bathroom and one in the cockpit. Quality Garmin sounder and a Lawrence plotter at lower helm. Current owners of Trinity have loved and looked after her. She is a clean, tidy and dry boat, all ready for a new skipper and family to enjoy\nRecent work: (October 2024): New anti-foul of hull. New propspeed coating applied to stern leg. New anodes installed and Hull polished.\nOther work: New Maxwell anchor winch, chain, and anchor installed, New upholstery (2022), Stern leg serviced, Interior painted to freshen it up, with care to retain original wood finish, 400L diesel tank taken out and professionally cleaned, with inspection hatches put on top of the tank, Custom-made staple installed on duckboard, to hold the dinghy, New batteries (house and start) installed 2024.\nBoat only: $65,000. Boat and Berth: $70,000.\nCost to rent berth at Hobsonville Marina from Vendor: $650 per month (depending on electricity usage at Berth)\nThis vessel is Turnkey ready to go for new owners, nothing to be done.\nContact Ian Duncan: 021 121 9524 ian@parkermarinegroup.co.nzto arrange private viewing.\nBoatCode: M900-ID"
  },
  {
    "title": "1986 Owen Woolley Pilot House",
    "ok": false,
    "info": "boatName: 1986 Owen Woolley Pilot House\nLocation: Auckland\nBroker: Ian Duncan\nLong Description: This mid pilot house Owen Woolley launch is beautifully presented. First touched the water in 1986 and acclaimed by Boating NZ in their boat test (Have copy of the magazine on board). Subsequent owners have maintained and improved her to very high standards. Major 2017 refit added an enclosed all weather pilot house and full topsides repaint. Much more was included at this time and today she stands out as one of Owen Woolley’s finest. Economical single shaft 320hp Caterpillar has had top half overhaul by current owners. 9 to 12 knots cruising and bow thruster for easy handling. Approximately 18Lph @ 9 knots for 400+NM range. Up to date EWOF 230V shore power and inverter/charger for at sea. 600AH house battery bank and separate start system. Private 3 cabin layout with owners’ cabin aft (Full shower/WC adjacent). Two separate twin bunk cabins forward. Second bathroom forward. Teak interior showcases Alchemy’s craftmanship and is easy to maintain. Big entertainers’ galley has direct access to the cockpit and salon. Crowning piece is the pilot house up the internal stairs from the salon. Commanding view and an array of comfortable lounging seating plus day bed. Quality nav electronics. The owner wants action and has engaged PMG to invite offers. Viewing this Kiwi icon is a pleasure. We will take you through the steps to purchasing this fine Launch and make the process as enjoyable as the pride of ownership. Asking price is for Alchemy only, however her 15M Gulf Harbour marina can be included in the sale and would be looked upon favourably as a package. Trade for a 12m modern yacht plus cash could also be considered.\nContact the owners PMG agent Ian Duncan: WhatsApp/txt/call 021 121 9524 or email ian@parkermarinegroup.co.nz\nBoatCode: OWMPH-ID"
  },
  {
    "title": "1986 Pelin Dominator",
    "ok": false,
    "info": "boatName: 1986 Pelin Dominator\nLocation: Picton\nBroker: Dave Radford\nLong Description: This Pelin Dominator was launched in 1986. She currently cruises the Marlborough Sounds from her berth in Havelock marina. Powered by a 400hp Caterpillar Diesel, she cruises easily at 9 knots with a max of 12 knots. She has 5 berths to accommodate the family in comfort and is ready for her new owners. Our vendor has already purchased his new vessel, so Andros must be sold. This is your opportunity to have a batch on the water in the beautiful Marlborough Sounds. Imagine summers spent in some of the most secluded and stunning bays in New Zealand.\nContact our Vendors Sole Agent, Dave Radford, on 0272577071 or email dave@parkermarinegroup.co.nz\nBoatCode: AND-DR"
  },
  {
    "title": "1987 Markline 1100 Deluxe",
    "ok": false,
    "info": "boatName: 1987 Markline 1100 Deluxe\nLocation: Auckland\nBroker: Ian Duncan\nLong Description: These Markline 1100’s are extremely popular vessels, being constructed in solid fiberglass making them as maintenance free as any good quality vessel can be, and don’t they look good going through the water. Their styling is as good today, as it was 36 years ago when she was launched. Our vendor says “She’s a good old boat, and the motors use no oil or water after 3500 hours run time. \nFor more information, or to schedule a viewing of this vessel, please contact Ian Duncan.\nPhone: 021 121 9524\nEmail: ian@parkermarinegroup.co.nz\nBoatCode: M11D-ID"
  },
  {
    "title": "1988 Ganley Clipper",
    "ok": false,
    "info": "boatName: 1988 Ganley Clipper\nLocation: Whangarei\nBroker: Flynn Hart\nLong Description: This Circa 1988 Ganley Pastime X Pine Island Clipper is now for sale. Designed by Dennis Ganley, she was built as an expedition /heavy weather boat. She needs a tidy up, but her bones are very good, and she would make an excellent offshore vessel or liveaboard. Contact her vendors sole agent, Flynn Hart on 02108594195 or email him on flynn@parkermarinegroup.co.nz\nBoatCode: GP-FH"
  },
  {
    "title": "1989 Bayliner 3488                                                                                      ",
    "ok": false,
    "info": "boatName: 1989 Bayliner 3488                                                                                      \nLocation: Auckland\nBroker: Flynn Hart\nLong Description: Launched in 1989, and built in solid GRP, this Bayliner 3488 is well worth taking the time to view.\nWith Mediterranean good looks and pushed along by the ever reliable, twin 220hp Hino's, she cruises at 15-17 knots.\nThis 2 cabin flybridge cruiser is a winner and with modern electronics, including VHF, radar, log/speedo, GPS, chartplotter, depthsounder, fishfinder, stereo, CD and TV, she has everything you will need to enjoy this fast-approaching summer and beyond. Complimented with 2.2m of headroom and accommodation for 4 in 2 double berths. This vessel must go to the top of your short list. Contact Flynn Hart on 02108594195 or email flynn@parkermarinegroup.co.nz\nBoatCode: 3488-FH"
  },
  {
    "title": "1989 Genesis 33",
    "ok": false,
    "info": "boatName: 1989 Genesis 33\nLocation: Auckland\nBroker: Flynn Hart\nLong Description: Here is another wonderful Genesis 33, all ready for summer cruising with the family.\nShe is turnkey ready, so Contact Flynn Hart on 02108594195 or email flynn@parkermarinegroup.co.nzfor further information.\nBoatCode: LRon-FH"
  },
  {
    "title": "1990 10.5m Pelin Eclipse",
    "ok": false,
    "info": "boatName: 1990 10.5m Pelin Eclipse\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: This 1990 10.5m Pelin Eclipse has been maintained extremely well and all maintenance records have been kept by her owner. She has an extended cockpit and a new Yanmar 315hp and a Bravo IIx Sternleg was fitted in 2009 and has done 3220 hours. She is fully Game Rigged and has both 1kw low chirp and 1kw B260 transducers. This boat is reliable and turnkey ready for her next owner.\nThis is a VERY reluctant sale. Contact Paul Oldham on 0274991028 or email paul.o@parkermarinegroup.co.nz\nBoatCode: TV-PO"
  },
  {
    "title": "1990 Bayliner 3888",
    "ok": false,
    "info": "boatName: 1990 Bayliner 3888\nLocation: Auckland\nBroker: Ian Duncan\nLong Description: Phase III is a cut above the rest of the Bayliner 3888 fleet. Back in the Sates she had some desirable and expensive under hull modifications. The standard rounded chines have been squared off and subtle lift contour added to the aft planning surface. Extended splash rails have been fitted forward and throw spray away for a dry ride. The result is she has a comfortable and flatter ride angle underway. Arguably she is more fuel efficient and stable at rest too.\nHave a watch of her underway video. https://youtu.be/pi1cmYzcFtA?si=-o4hNfLowjZEor6J\nThe current owners have added a hardtop with fully enclosed clears to the fly bridge.\nShe also sports a bait station on the generous boarding platform and Weaver style davit system for the Takacat Tender.\nThere is a 310watt solar panel to keep the batteries happy and an inverter to run your 240volt requirements in silent ship mode. Two private cabins with queen size doubles have shared access to the bath/shower plus their own separate toilets and vanities. This is well cared for launch that is very comfortable for extended cruises or even as a liveaboard.\nBoatCode: B3888-ID"
  },
  {
    "title": "1990 Beale 42",
    "ok": false,
    "info": "boatName: 1990 Beale 42\nLocation: Auckland\nBroker: Flynn Hart\nLong Description: Introducing the Timeless Elegance of the 1990 Beale 42.\nJust done 14/04/25 All coatings removed right back to gel coat and re-epoxied and antifouled. Hull topsides were also polished. SHE'S LOOKING GREAT!!\nAre you ready to set sail on an unforgettable adventure? Look no further than the exquisite 1990 Beale 42, where classic design meets modern performance. Crafted with precision and passion, this vessel embodies the essence of maritime excellence. The Beale 42 boasts a timeless design that turns heads in any harbor. With graceful lines, a sleek hull, and a spacious deck, this sailboat captures the essence of classic yachting.\nMeticulously crafted using only the finest materials, the Beale 42 exudes quality and durability. From its sturdy mast to its luxurious interior, every detail is designed to withstand the test of time. Whether you're cruising coastal waters or embarking on an ocean voyage, the Beale 42 delivers exceptional performance. Its efficient sail plan and responsive handling make sailing a breeze. Whether you're sailing solo or with a crew, the Beale 42 offers a versatile layout that adapts to your needs. With comfortable sleeping accommodations, a fully equipped galley, and ample storage space, this sailboat is perfect for weekend getaways or long-distance voyages, and racing. Don't miss your chance to own a piece of maritime history. Experience the elegance and performance of the 1990 Beale 42 Sailboat today! Contact us to schedule a private viewing or learn more about this iconic vessel. Smooth sailing awaits! Contact Flynn on 02108594195 or email flynn@parkermarinegroup.co.nz\nBoatCode: B42-FH"
  },
  {
    "title": "1990 Genesis 32 Euro",
    "ok": false,
    "info": "boatName: 1990 Genesis 32 Euro\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: The Genesis 32 Euro is a legend amongst boat owners for their seakeeping abilities and ride comfort.\nWith her twin 150hp Volvo diesels she cruises easily and economically at 17 – 20 knots, and if you have to run home, she can get up to 26 knots.\nComplete with outriggers, she is ready to go fishing, or for the more leisurely amongst us, she is a comfortable home away from home. Contact our vendors agent, Paul Oldham on 0274991028 or email paul.o@parkermarinegroup.co.nz\nBoatCode: SC-PO"
  },
  {
    "title": "1990 Mk1 Lotus",
    "ok": false,
    "info": "boatName: 1990 Mk1 Lotus\nLocation: Auckland\nBroker: Flynn Hart\nLong Description: Here is another great example of an Alan Wright designed Mk1 Lotus. This vessel was launched in 1990 and has been very well looked after. Powered by a 2003 28hp Volvo diesel which has done only 1496 hours. This boat comes turnkey ready with everything you need to sail away for summer. Contact Flynn Hart on 02108594195 or email flynn@parkermarinegroup.co.nz\nBoatCode: VEG-FH"
  },
  {
    "title": "1990 Scott Robson Power Cat",
    "ok": false,
    "info": "boatName: 1990 Scott Robson Power Cat\nLocation: Whitianga\nBroker: Mike Parker\nLong Description: Unleash Your Nautical Dreams with the 1990 Scott Robson Power Catamaran!\nAre you ready to experience luxury on the open water? Look no further than the 1990 Scott Robson Power Catamaran. This remarkable vessel, designed by renowned naval architect Scott Robson, combines cutting-edge technology with timeless elegance to deliver an unparalleled boating experience.\nMeticulously designed by Scott Robson, this catamaran showcases exceptional attention to detail and quality craftsmanship. The sleek, aerodynamic lines not only enhance its aesthetic appeal but also ensure optimal performance and fuel efficiency. Equipped with twin Cummins 6BTA 370hp Diesel turbo engines, this catamaran offers impressive speed and agility, making it perfect for both leisurely cruises and thrilling adventures.\nThe catamaran's twin-hull design provides unmatched stability, allowing for smooth and comfortable rides even in choppy waters. Embrace the freedom of the open sea with the 1990 Scott Robson Power Catamaran.\nYour journey begins here.\nPlease contact Mike on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: MA-MP"
  },
  {
    "title": "1990 Slickcraft S2 310SC",
    "ok": false,
    "info": "boatName: 1990 Slickcraft S2 310SC\nLocation: Wellington\nBroker: Aaron Bilham\nLong Description: A very well Presented and professionally maintained vessel. She has new full enclosure canvas covers with roll-up panels and reupholstered cockpit seating. There is plenty of space on the deck and in the cabin. A galley and a head with shower with hot pressurized water heated from the engines to a hot water cylinder.\nThe twin small block 350 Chev engines with a closed cooling system, this Slickcraft has a nice comfortable cabin with a Huge V-Berth and Aft Quarter berth to make your overnight stays comfortable.\nContact the vendors Sole Agent, Aaron Bilham on 0224245426or email aaron@parkermarinegroup.co.nz\nBoatCode: BOB-AB"
  },
  {
    "title": "1990 Vindex 3000 Sedan",
    "ok": false,
    "info": "boatName: 1990 Vindex 3000 Sedan\nLocation: Auckland\nBroker: Ian Duncan\nLong Description: ANAHERA is a Vindex 3000 Sedan, custom built for her original owner by Patullo Bros and launched 1990. Custom build with a completely bespoke interior and unique layout. The cockpit and helm area are simply enormous, giving a multitude of entertainment, water sports, dining and relaxing options. Dual live bait tanks and a big removable filleting board take care of the fish.\nAccess to the single 200hp Volvo Diesel is superb and makes servicing a breeze.\nShe cruises economically at 16 to 18 knots purportedly using only 18ltrs/hour.\nAs the sun goes down you can retire to the lower salon with full galley, Head & shower, Private double cabin and another double in the forepeak.\nThis launch is a well-conceived adaptation of the Vindex 3000 family that delivers easy two-level access throughout.\nHer very special marina berth at Milford Marina may also be available upon application to Milford Mariners.\nThe berth she occupies is on the first Pier to receive a floating walkway, power, water and security gate.\nThis project is transforming Milford Marina to rival any in Auckland and is in an extremely desirable location.\nContact the owner’s sole agent Ian Duncan for a personal viewing: Txt/call 021 121 9524 or email\nian@parkermarinegroup.co.nz\nBoatCode: V3000-ID"
  },
  {
    "title": "1991 Sea Ray M1-350DA-557 ",
    "ok": false,
    "info": "boatName: 1991 Sea Ray M1-350DA-557 \nLocation: Auckland\nBroker: Ian Duncan\nLong Description: If you're looking for a powerboat that delivers both thrilling speed and luxurious comfort, Kudosis the vessel for you! This 1991 Sea Ray M1-350DA-557 is a proven performer, powered by twin 230hp Volvo Penta KAD42 Kompressor Diesel Engines, giving her the muscle to push up to 35 knots on open water. Whether you're chasing the horizon or cruising in style, Kudos offers the perfect balance of power, precision, and prestige.\nIf you're looking for a weekend escape, a performance-driven cruiser, or a head-turning boat at the marina, Kudos is ready to impress. With power, elegance, and Sea Ray’s legendary build quality, this is a rare opportunity to own a boat that offers speed and sophistication in one package.\nContact our vendors sole agent, Ian Duncan, on 0211219524 or email ian@parkermarinegroup.co.nz\nBoatCode: KU-ID"
  },
  {
    "title": "1992 Elite Cabriolet Sedan",
    "ok": false,
    "info": "boatName: 1992 Elite Cabriolet Sedan\nLocation: Auckland\nBroker: Ed Griffin\nLong Description: The very popular Bill Upfold designed and built, 1992 Elite Cabriolet Sedan is a very economical high-speed launch.\nShe is perfect for cruising the waters of New Zealand’s coast and harbours.\nWith a huge comfortable cockpit for fishing and diving, she is perfectly set up for weekend or extended cruising.\nEasy to handle and set up for families. Two double berths and one single. Plus, a full-size toilet and shower.\nUpdated interior with fridge, freezer, 2 burner stove/oven, vanity, toilet, showers in and out.\nLarge, enclosed lounge area and outdoor with awning.\nComes with a dingy and a new Yamaha 3hp outboard.\nBatteries recently renewed, plus an extensive battery pack installed.\nShe has all the usual certificates, and electronics.\nAll services have been done by Ovlov Marine with maintenance records available.\nRecent upgrade of port engine and two new stern legs installed.\nSound hull structure, and the topsides are in excellent condition.\nThe same owners since 2011 have kept this boat in good condition and she is very well maintained.\nBerth rental an option. Contact Mike Parker on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: EC-EG"
  },
  {
    "title": "1992 Mariner 28 Flybridge",
    "ok": false,
    "info": "boatName: 1992 Mariner 28 Flybridge\nLocation: Tauranga\nBroker: Matthew Woodman\nLong Description: Looking for the ideal balance between practicality, performance, and style? This 1992 Mariner 28 Flybridge is the perfect vessel for cruising, fishing, and weekend adventures. Designed with both comfort and capability in mind, she offers a smooth ride, efficient performance, and a well-thought-out layout to maximize your time on the water. Equipped with a reliable 240HP Yanmar diesel engine, this Mariner 28 delivers a cruising speed of 13 knots and can push up to 20 knotswhen you need that extra burst of power. Whether you're heading offshore for a fishing trip or exploring coastal waters, you’ll appreciate her fuel efficiency and responsive handling. Take command from the elevated flybridge, offering excellent visibility, comfortable seating, and an intuitive helm station. Whether you're navigating tight marinas or scanning the horizon for the next fishing hotspot, the flybridge provides the perfect vantage point. Step inside, and you’ll find a well-appointed cabin, perfect for weekend getaways or extended stays aboard. The saloon offers ample seating, a practical galley, and a cozy dinette. A private forward cabin ensures restful nights, while the enclosed head with shower adds convenience for longer trips. The spacious cockpit is ideal for fishing, entertaining, or simply soaking up the sun. With plenty of storage, rod holders, and an easy-access swim platform, this Mariner 28 is built to handle whatever adventure you have in mind. Whether you're an avid angler, a weekend cruiser, or looking for a reliable and stylish family boat, this 1992 Mariner 28 Flybridge checks all the boxes. Don’t miss out.\nContact our vendors Sole Agent, Matt Woodman to arrange a viewing and see for yourself why this boat is the perfect fit for your next adventure! Phone 02040791529 or email matt@parkermarinegroup.co.nz\nBoatCode: M28-MW"
  },
  {
    "title": "1992 Pelin Liberty",
    "ok": false,
    "info": "boatName: 1992 Pelin Liberty\nLocation: Auckland\nBroker: Ian Duncan\nLong Description: The Pelin Liberty’s current owner is following new pursuits and wants to find another caring custodian.\nShe has recently undergone a professional forward cabin top reconstruction and has a completely shipshape exterior. All of Frank Pelin’s designs are known for their easily driven and sea kindly traits, and the liberty’s stand out as some of his finest. Cummins shaft drive gives an economical 12 knot cruising speed.\nThe live bait tank is built into her boarding platform, and the tender is on weaver davits for easy deployment. With the dinghy stowed on the foredeck, Silverfox should just fit into a 12m marina berth.\nThe teak laid cockpit has a generous lazarette and ladder access to the fly bridge. Saltwater washdown,\nfreshwater hand basin and shower. The saloon has an aft galley with a separate fridge and freezer. There is an additional large freezer under the convertible settee forward of the galley. Lower helm and dinette to starboard. Forward, bathroom to port with head, vanity, and shower. Double berth cabin to Starboard with single bunk above. Vee berth cabin in forepeak.\nViewing at Gulf Harbour with Ian Duncan 021 121 9524 ian@parkermarinegrop.co.nz\nBoatCode: PLsil-ID"
  },
  {
    "title": "1992 Vindex 3000 Flybridge",
    "ok": false,
    "info": "boatName: 1992 Vindex 3000 Flybridge\nLocation: Auckland\nBroker: Ian Duncan\nLong Description: Vindex 3000, designed by Jim Young & built by Senior boatbuilders of GRP. Beautiful Teak interior is a standout feature of the Senior built 3000’s and this one is in superb condition. launched 1992 and powered by a 230hp Volvo diesel giving 12-lph @ 16kts with a max of 22kts. Bow thruster for easy maneuvering and auto anchor for convenience. A great family boat with two cabins, a double master and a 3-bunk cabin. Fully canvas enclosed fly-bridge and cockpit. Lots of upgrades to the engine including new turbo, exhaust elbow, aftercooler, fuel lines, water pump and new stern leg in 2022.\nAt 10.1m LOA she fits neatly into a 10.5m berth.\nThe owner has not been able to use this launch much in the last few years, however maintenance has been kept up and she is a very desirable example. NB: Her stern leg has less than two hours run time on it since new in 2022.\nPlease contact the owner’s sole agent Ian Duncan for your private viewing at Gulf Harbour Marina.\nEmail ian@parkermarinegroup.co.nz or Phone 021 121 9524.\nBoatCode: SR-ID"
  },
  {
    "title": "1993 47ft Pelin Eclipse",
    "ok": false,
    "info": "boatName: 1993 47ft Pelin Eclipse\nLocation: Picton\nBroker: Dave Radford\nLong Description: Buying a 1993 47ft Pelin Eclipse flybridge launch is appealing for several reasons\nDesign: The Pelin Eclipse has a timeless, classic design that appeals to many boating enthusiasts.\nQuality Construction: Pelin boats are known for their solid construction and durability.\nStability: The design provides stability and a smooth ride in any sea condition.\nHandling: They offer good handling and maneuverability, making them suitable for both novice and experienced boaters.\nSpacious Layout: She offers ample living space, comfortable sleeping quarters, nice sized galley, and a roomy salon.\nFlybridge: Excellent vantage point for enjoying the surroundings, and additional seating with a secondary helm station.\nMultiple Uses: The Pelin Eclipse can be used for a variety of activities, such as cruising, fishing, and entertaining guests.\nRange: With its size and fuel capacity, it is suitable for longer trips and coastal cruising.\nAesthetics and Experience: Owning a flybridge launch like the Pelin Eclipse provides a unique and enjoyable boating experience, blending nostalgia with practicality. Buying this 1993 47ft Pelin Eclipse is for those who appreciate classic design, quality construction, and versatile performance.\nPlease contact the listing broker, Paul Davey on 021 653 202 paul.d@parkermarinegroup.co.nz\nBoatCode: TE47-DR"
  },
  {
    "title": "1993 Pedrick 40",
    "ok": false,
    "info": "boatName: 1993 Pedrick 40\nLocation: Auckland\nBroker: Flynn Hart\nLong Description: This Sirena Pedrick 40 is in great condition, although the interior, while completely functional, could do with an update.\nBuilt in Finland by Lito Marin shipyard from the drawing board of David Pedrick, famous for America One project.\nShe is one of only 22 ever produced.\nThese vessels were all semi-custom builds, from a country that gave us Swan and X-yachts.\nThe Pedrick 40 is very comfortable and can easily accommodate up to 6 in her spacious 2 cabin plus saloon layout.\nBoatCode: PED-FH"
  },
  {
    "title": "1994 Keith Eade Custom Flybridge",
    "ok": false,
    "info": "boatName: 1994 Keith Eade Custom Flybridge\nLocation: Auckland\nBroker: Ed Griffin\nLong Description: VESSEL – SELLING POINTS\nBuilt for her original owner in 1994, it is clear that a lot of time and money was invested in building the boat of his dreams. The current owners purchased it from him in December 2019. It has a beautiful white interior which is what attracted them to her. The white makes her look modern, clean, and spacious. She has a Northern Lights generator, a Bauer dive compressor, and the largest fridge this broker has seen in the galley of a vessel like this one, also providing ample freezer space and lots of storage. The engines were fully rebuilt the year the current owners purchased her, and they also updated her electronics package to the latest Furuno electronics.\nThis vessel really is a special boat, and she gets lots of comments on how good she looks.\nThe purchase of the Pine Harbour marina berth is also an option.\nBoatCode: ACKE-EG"
  },
  {
    "title": "1994 Kennedy 11m",
    "ok": false,
    "info": "boatName: 1994 Kennedy 11m\nLocation: Auckland\nBroker: Ed Griffin\nLong Description: Are you in the market for a vessel that combines timeless elegance, superior craftsmanship, and robust performance? Look no further than this 1994 Kennedy 11m Flybridge Launch.\nThe Kennedy 11m Flybridge Launch boasts a sleek, timeless design that stands out in any marina. With its beautiful lines and classic silhouette, this vessel exudes an air of refinement and prestige.\nEnjoy unparalleled views and command your voyage from the elevated flybridge. With ample seating and a well-designed helm, the flybridge is perfect for entertaining guests or simply soaking in the sun.\nContact us today to schedule a viewing. Your dream boat awaits!\nContact Mike on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: Marc11-EG"
  },
  {
    "title": "1994 Precision 30",
    "ok": false,
    "info": "boatName: 1994 Precision 30\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: Hundreds of hours spent on full rebuild. Fully documented rebuild log available to anyone interested.\nThe boat is very well kitted out with lots of good gear all new when boat was relaunched with no expense spared, a must see if you are looking for this type of boat.\nEngine service done this year\nBottom paint done end of last year, sprayed on.\nHull polish done end of last year\nCall/txt/email Vendor’s broker – Paul Oldham 0274991028 paul.o@parkermarinegroup.co.nz\nBoatCode: P30-PO"
  },
  {
    "title": "1994 Riviera 33",
    "ok": false,
    "info": "boatName: 1994 Riviera 33\nLocation: Whangarei\nBroker: Mike Parker\nLong Description: Set Sail for Adventure with \"SENATOR” 1994 Riviera 33 Flybridge Launch!\nThis is more than a boat — SENATOR is your gateway to the sea’s endless possibilities. Powered by twin 210hp Cummins diesels, she’s built to conquer the waves with strength and style. Whether you’re chasing marlin on the open blue or cruising the coast in comfort, this legendary Riviera 33 delivers performance, reliability, and the thrill of the chase.\nFeel the power beneath your feet.\nCommand the ocean from the flybridge.\nCreate unforgettable moments with family and friends.\nSENATOR isn’t just a vessel — she’s a statement. A call to embrace the salt air, the roaring engines, and the freedom only the sea can offer.\nIt’s time to stop dreaming and start living. Answer the ocean’s call — make SENATOR yours today!\nContact Mike on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: SEN-MP"
  },
  {
    "title": "1994 Wavecrusher",
    "ok": false,
    "info": "boatName: 1994 Wavecrusher\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: Vessel was inspected for insurance purposes in 2023 and passed with no issues found and is currently fully insured with Tower Insurance. Engine was fully reconditioned 8 years ago, she had a new Gearbox in 2020, a new turbo was fitted in 2022, New house and start batteries fitted 2024 along with new clear. Anchor winch was reconditioned in 2021.\nPlease contact the vendors sole agent: Paul Oldham on 0274991028 or email paul.o@parkermarinegroup.co.nz\nBoatCode: SHAN-PO"
  },
  {
    "title": "1995 Hunter 336",
    "ok": false,
    "info": "boatName: 1995 Hunter 336\nLocation: Christchurch\nBroker: Ashleigh Macdonald\nLong Description: Aolele boasts sleek modern lines, a spacious and light interior, roomy cockpit-perfect for entertaining and is well set up for short-handed coastal sailing.\nDesiged by Rob Mazza and launched in 1995 this is the perfect family coastal cruising boat with a touch of elegance about her. The interior layout is particularly spacious with two cabins, a decent sized galley and saloon, and separate head and shower. The Hunter 336 allows for comfortable living aboard for the whole family. The boarding platform and walk through transom mean easy access on and off the boat.\nPowered by a reliable Yanmar 3GM30F she has been well loved and maintained by her current owner.\nContact our Vendors Sole Agent, Ashleigh, on 0273263486 or email her ashleigh@parkermarinegroup.co.nz\nBoatCode: AOLELE-AM"
  },
  {
    "title": "1995 Vindex 375L",
    "ok": false,
    "info": "boatName: 1995 Vindex 375L\nLocation: Auckland\nBroker: Ed Griffin\nLong Description: Are you in the market for a vessel that combines timeless elegance, superior craftsmanship, and robust performance? Look no further than this 1995 Vindex 375L enclosed Flybridge Launch.\nThese Vindex boats are sleek, and timeless and they stand out in any marina. With her beautiful lines and classic silhouette, this vessel exudes an air of refinement and prestige.\nEnjoy unparalleled views and command your voyage from the elevated flybridge. With ample seating and a well-designed helm, the flybridge is perfect for entertaining guests or simply soaking in the sun.\nContact us today to schedule a viewing. Your dream boat awaits!\nContact Mike on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: TIT375-EG"
  },
  {
    "title": "1996 Genesis 320 Euro",
    "ok": false,
    "info": "boatName: 1996 Genesis 320 Euro\nLocation: Tauranga\nBroker: Matthew Woodman\nLong Description: Genesis 320 Euro in good condition with premium Tauranga Marina Berth F8 at Sulphur Point (separate sale with marina society) Fitted with Mercruiser 320hp (low hours) with Bravo 2 leg - leg bearings and gears replaced and upgraded gimble bearings replaced less than one year ago 560 litre fuel capacity 320 litre fresh water. Electric toilet with holding tank using salt or freshwater Freshwater engine flushing system with Saltaway option. Engine driven compressor fridge, freezer and cockpit cooler. H&C shower in head and stern (engine heated). Saltwater washdown hose. Simrad chartplotter/fishfinder. 50m anchor chain and added rope operated from helm. 2 double and 1 single berth layout.\n2.7m Tender on Weaver davit system, with a 3.3hp Mercury outboard. 3000W inverter fitted to auto-changeover relay to shore power. 180W solar panel fitted to house battery bank. Smart charger connected to shore power. Recent propspeed applied to prop and trim tabs. Coppercoat antifoul applied but needs recoating. LPG stove fitted. Contact Matt Woodman on 02040791529 or email matt@parkermarinegroup.co.nz \nBoatCode: STB-MW"
  },
  {
    "title": "1996 Pelin Crusader",
    "ok": false,
    "info": "boatName: 1996 Pelin Crusader\nLocation: Whangaroa\nBroker: Flynn Hart\nLong Description: This 1996 Pelin Crusader is a stunning example of this Frank Pelin design, and if you’re looking for a large volume vessel, then she really is worth you viewing her. Powered by a very reliable and meticulously serviced 320hp 3208 Cat diesel engine, she cruises at 9 knots all day long. She sleeps 6 comfortably and would make a perfect liveaboard or coastal cruiser. Contact Flynn on 02108594195 or flynn@parkermarinegroup.co.nz\nBoatCode: NIR-FH"
  },
  {
    "title": "1996 Riviera 33 Platinum Series",
    "ok": false,
    "info": "boatName: 1996 Riviera 33 Platinum Series\nLocation: Auckland\nBroker: Ian Duncan\nLong Description: This is a desirable Riviera 33 Platinum Series with the rare twin cabin accommodation forward.\nBeing 11.46m overall, she still fits a 12M berth whilst retaining all the benefits of her larger sister’s accommodation. Superb fishing and water sports cockpit area including live bait tank, filleting station, Large inbuilt 12v freezer, numerous rod holders, rocket launcher rod storage, underwater lighting, flood lighting and saltwater wash down.\nEasy access to the engine room from the cockpit. Twin Cummins 6BT’s have been replaced with remanufactured long blocks only 821Hrs ago. These give a comfortable 15 to 18knot cruise and over 20Knot sprint.\nExcellent flybridge with primary helm electronics, hard top with solar panels and Ocean Blue outriggers.\nLower helm duplicates engine instruments and has simple tablet navigation. Salon dinette converts to double when required. Galley has two burner hob and oven, 12v fridge and plenty of storage. The big bonus on this Riviera is that she has a twin bunk cabin to starboard and a separate double cabin in the bow. The bow master has a luxurious mattress across the full width. The portside has the bathroom with electric head and shower.\nContact our Sole Agent, Ian Duncan to arrange a viewing of Nautilus - txt/WhatsApp/call 021 121 9524 or email ian@parkermarinegroup.co.nz\nBoatCode: R33PS-ID"
  },
  {
    "title": "1996 Vindex 470",
    "ok": false,
    "info": "boatName: 1996 Vindex 470\nLocation: Tauranga\nBroker: Paul Oldham\nLong Description: Introducing the Vindex 470 Sport Fisher: Your Ultimate Fishing Companion!\nAre you ready to elevate your boating experience to a whole new level? Look no further than the Vindex 470 Sport Fisher\nLet me take you on a journey through the exceptional features of this remarkable vessel.\nPowered by twin 3208 Cat diesels, the Vindex 470 Sport Fisher ensures a thrilling ride on the open water. With its efficient design and advanced hull technology, you'll cut through the waves with ease, reaching your favorite fishing spots in record time.\nThe Vindex 470 Sport Fisher features a well-appointed cabin with seating for you and your crew. Enjoy the convenience of onboard storage, a galley area, and a private head, ensuring that every journey is as comfortable as it is exciting.\nThe Vindex 470 Sport Fisher boasts a timeless design that turns heads wherever it goes. With sleek lines and a classic aesthetic, this boat not only performs exceptionally but also looks stunning.\nCrafted with durability in mind, the Vindex 470 Sport Fisher is built to withstand the rigors of offshore adventures. Whether you're battling challenging sea conditions or reeling in a trophy catch, rest assured that this boat is up to the task, offering longevity and reliability.\nOwning the Vindex 470 Sport Fisher is not just acquiring a boat, it's an investment in a lifestyle of adventure, camaraderie, and the thrill of the catch. Create lasting memories with friends and family as you explore the vast possibilities that come with this exceptional vessel.\nDon't Miss Out! Act Now:\nSeize the opportunity to own this versatile, high-performance boat which is ready to take you on unforgettable journeys and provide a platform for countless family fun times.\nThis boat is in very good condition, all electrical wiring and batteries replaced, engines were serviced about a month ago, it’s been well looked after and cared for, and she goes very well.\nBoatCode: V470-PO"
  },
  {
    "title": "1996 Wagstaff 40",
    "ok": false,
    "info": "boatName: 1996 Wagstaff 40\nLocation: Auckland\nBroker: Flynn Hart\nLong Description: Introducing HIGH OCTANE\nWagstaff 12m – elegant racer/cruiser commissioned and launched 1996 by Richard Endean.\nFun spacious performer, in race and cruising modes.\nHas cruised to Wellington, Marlborough Sounds, Karikari Peninsula and many times to Great Barrier.\nIncredibly responsive to the helm and very easily manoeuvred in the marina.\nUnique design by noted architect and boat designer Hal Wagstaff\nConstruction design by High Modulus.\nConstructed with uncompromising attention to strength, with heart macrocarpa around keel, and cedar to the waterline and foam core above waterline, all glassed over. Contact our vendors sole agent, Flynn Hart on 02108594195 or email flynn@parkermarinegroup.co.nz \nBoatCode: WAG-FH"
  },
  {
    "title": "1997 10m Lidgard Demon",
    "ok": false,
    "info": "boatName: 1997 10m Lidgard Demon\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: Strong, sturdy and beautiful. If you’re looking for a comfortable cruiser to keep you and the whole family safe, come and check this 10m Lidgard Demon out. She has beautiful lines that reflect her Lidgard pedigree, and she looks as if she just wants to sail. Bring the family and spend fun filled hours sailing and relaxing on the water.\nGreat condition, well maintained by marine engineer owner, superbly crafted, easily sailed solo, light and airy, Big Fridge and Freezer, Good electronics. Don’t miss your opportunity to own this quality crafted vessel.\nContact Paul Oldham on 0274991028 or email paul.o@parkermarinegroup.co.nz\nBoatCode: LDF-PO"
  },
  {
    "title": "1997 Don Senior",
    "ok": false,
    "info": "boatName: 1997 Don Senior\nLocation: Whangaroa\nBroker: Mike Parker\nLong Description: Don Senior is one of the well-known boat designers and builders in New Zealand. His designs have been highly regarded for their innovation, performance, and seaworthiness, making him a respected figure in the boating community.\nSenior's design philosophy focuses on creating boats that are both functional and aesthetically pleasing. His vessels are known for their robust construction, excellent handling, and ability to perform well in New Zealand's often challenging sea conditions. He emphasizes safety, comfort, and efficiency in all his designs, making his boats popular among both serious mariners and recreational boaters. WAIKOPOU a 13m Don Senior, enclosed flybridge launch, is no exception, and her current owners lavished thousands of dollars on her to update and enhance her even further.\nNB: This is an exceptional vessel, at an exceptional price. Simply MUST be viewed!!\nPlease contact the vendors sole agent: Mike Parker on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: WaiDS-MP"
  },
  {
    "title": "1997 Pelin Sports Cruiser",
    "ok": false,
    "info": "boatName: 1997 Pelin Sports Cruiser\nLocation: Tinopai\nBroker: Mike Parker\nLong Description: BOAT AND BERTH FOR $95,000\nLaunched in 1997, GOP hull, GRP superstructure. Powered by 150hp Volvo diesel giving 16 - 24 knots. 6'2\" headroom with 1 single and 1 double berth. Electronics include VHF, log/speedo, GPS, chartplotter, depthsounder, fishfinder, stereo and CD player. Plus+++ Auto Remote Anchoring.\nContact our vendors sole agent, Mike Parker on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: HM-MP"
  },
  {
    "title": "1997 Sea Ray 290",
    "ok": false,
    "info": "boatName: 1997 Sea Ray 290\nLocation: Kerikeri\nBroker: Flynn Hart\nLong Description: If you like your boating adventures to be at a fast pace and done in real style, then you can't go past this 1997 Sea Ray 290. With 3 Double Berths, she can accommodate you and your mates with ease for day trips of weekends away. Contact the listing Broker, Flynn Hart, on 02108594195 or email him flynn@parkermarinegroup.co.nz\nBoatCode: SR290-FH"
  },
  {
    "title": "1998 14m Dorado - MV Flyer",
    "ok": false,
    "info": "boatName: 1998 14m Dorado - MV Flyer\nLocation: Christchurch\nBroker: Ashleigh Macdonald\nLong Description: VESSEL – SELLING POINTS:\nWarm, dry, comfortable cruiser that easily accommodates 6 - 7 people.\nGood indoor/outdoor flow via sliding glass door\nSpacious shower & toilet\nLarge dive platform with good ladder for entry/exit from water.\nStorage for crayfish pots & kayaks on dive platform or roof.\nExcellent deck space for fishing & divers, socializing.\nFlybridge has seating & provides excellent space for watching sunrises & sunsets.\nGreat sea keeping ability, handles well in all weather conditions.\nVery sound mechanically.\nContact Ashleigh on 0273263486 or email ashleigh@parkermarinegroup.co.nz\nBoatCode: FLYER-AM"
  },
  {
    "title": "1998 Lidgard Regardless",
    "ok": false,
    "info": "boatName: 1998 Lidgard Regardless\nLocation: Auckland\nBroker: Mike Parker\nLong Description: The Lidgard brand is synonymous with quality in the sailing community. The Regardless model has established itself as a reliable choice among sailors who value both performance and comfort. Additionally, John Lidgard's legacy as an innovative designer adds to the yacht's allure, because he was known for his deep understanding of marine design principles. In summary, the Lidgard Regardless sailing yacht distinguishes itself through its robust construction, exceptional sailing performance, comfortable accommodations, and the esteemed legacy of its designer. These attributes make it a compelling choice for both seasoned sailors and those new to the world of sailing. The Regardless is built with a hull made of glass over three-skin Kauri, a material known for its strength and durability, which contributes to the yacht's longevity and performance in various marine conditions. Specifically designed as a passage maker, the Regardless offers excellent offshore sailing capabilities, making it suitable for long-distance cruising and adventure sailing. Mischief Maker has been maintained meticulously and is ready for new adventures on the water.\nWith its combination of performance, comfort, and robust construction, the Lidgard Regardless is an ideal choice for sailors looking to explore the seas with confidence. Beautiful teak decks (Glued down, NOT SCREWED) make her stand out from others. Contact Mike Parker on +64 275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: MM-MP"
  },
  {
    "title": "1998 Logan 33",
    "ok": false,
    "info": "boatName: 1998 Logan 33\nLocation: Opua\nBroker: Josh Weeks\nLong Description: FOR SALE:\n1998 REPLICA LOGAN 33 – TIMELESS CLASSIC BUILT IN WHANGAREI, NEW ZEALAND\nLeave the Dock in Elegance and Tradition\n Experience the romance of a bygone era with this beautifully crafted 1998 Replica Logan 33, built with precision and passion in Whangarei, New Zealand. Designed to capture the charm of early 20th-century; while incorporating modern construction techniques, this stunning vessel is the perfect combination of heritage, performance, and reliability. Contact our vendors Sole Agent Josh Weeks on 0276105527 or email josh@parkermarinegroup.co.nz\nBoatCode: DOLL-JW"
  },
  {
    "title": "1998 Norseman 430",
    "ok": false,
    "info": "boatName: 1998 Norseman 430\nLocation: Tauranga\nBroker: Mike Parker\nLong Description: PRICE REDUCED TO SELL!!\nThe Norseman 4300 is a sailing catamaran designed for cruising and leisure sailing.\nThe Norseman 4300 features a sleek and modern design, with clean lines and a spacious deck layout optimized for comfort and performance. These catamarans are foam core construction using advanced composite materials such as fiberglass, carbon fiber, and epoxy resin, ensuring durability and strength while keeping weight to a minimum.\nThe Norseman 4300 features a high-performance rigging setup, including a large mainsail and a foresail (genoa or jib), allowing for efficient sailing in various wind conditions. The cockpit area is spacious and designed for comfort, providing ample seating for the crew and guests. The interior features a large saloon area, which serves as the main living space onboard. These catamarans offer multiple cabins for accommodation, including a master cabin and guest cabins. The cabins are designed to maximize comfort and privacy. Overall, the Norseman 4300 is a luxurious vessel designed to provide an enjoyable sailing experience.\nContact Mike on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: NOR43-MP"
  },
  {
    "title": "1999 Genesis Profish Sedan",
    "ok": false,
    "info": "boatName: 1999 Genesis Profish Sedan\nLocation: Auckland\nBroker: Ed Griffin\nLong Description: Step aboard the sleek and powerful 1999 Genesis Profish, where adventure meets luxury on the open water!\nCrafted with precision and passion, this vessel is your ticket to exhilarating marine experiences.\nPicture yourself cruising effortlessly through the waves, powered by a 310hp Yanmar 6LP-STZE diesel engine that ensures impressive speed. Whether you're chasing the thrill of water sports or seeking serene moments of relaxation, the Genesis Profish delivers on all fronts.\nWith its spacious cockpit and comfortable seating, this vessel invites you to bring along family and friends for unforgettable outings. Revel in the freedom of open-air adventure as you soak up the sun and take in panoramic views of your surroundings.\nBut it's not just about performance and practicality—the Genesis Profish boasts a stylish design that turns heads wherever it goes. Its timeless aesthetic and attention to detail make it a true standout among its peers, reflecting your discerning taste and passion for the finer things in life.\nContact Mike on 0275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: GENPRO-EG"
  },
  {
    "title": "2001 11m Pelin Eclipse",
    "ok": false,
    "info": "boatName: 2001 11m Pelin Eclipse\nLocation: Auckland\nBroker: Ian Duncan\nLong Description: Professionally built by Hill Boat Builders in 2001, this Pelin Eclipse is Double diagonal Kauri glassed construction and powered by a 230hp Volvo KAD43 Kompressor Diesel with 290 Stern Leg. Cruising around 16 knots and a sprint speed of over 20 knots, 6'3\" headroom with 1 single and 2 double berths, hot and cold pressurized water. Electronics incl 140w solar panel and regulator, VHF, GPS (2), Radar (25nm), Depth Sounder (colour sidescan), stereo, Digital TV, shore power certified EWOF and tagged dock power lead. 2.5m Tak a Kat tender, 3.3hp Mariner o/b. Nice extras like tender davit on the fore deck, Bow Thruster, Enclosed fly bridge, Bridge controlled anchor winch (o/h 2024), Elect toilet, 40ltr holding tank, New house and start batteries. New props 2018. Major engine and stern leg o/h 2023, clean and anti-fouling done.\nThis is a much-loved launch of retiring boaties that have owned her since 2013. She has holidayed their grown family and grandchildren. Many fond memories have been made and now she is ready to take her next owners on new adventures.\nPlease contact Sole agent, Ian Duncan 021 121 9524. Email: ian@parkermarinegroup.co.nzfor your private viewing at Gulf Harbour.\nBoatCode: CEW-ID"
  },
  {
    "title": "2001 Ganley Woods Island Commuter",
    "ok": false,
    "info": "boatName: 2001 Ganley Woods Island Commuter\nLocation: Christchurch\nBroker: Ashleigh Macdonald\nLong Description: Strong, safe and sturdy - This 30ft Ganley Woods Island Commuter was launched in 2001 and has been loved and maintained by the same owners since launch. She is super tidy, clean and well laid out. Pegasus has been loved as a coastal family cruising vessel, having spent time around Banks Peninsula, Marlborough sounds and into Abel Tasman. Powered by a reliable 50hp Perkins that was re-conditioned in 2001 she cruises under motor at 5 knots. She sails well and has a new in 2021 headsail and a main which is in good condition.\nThe interior is light, airy and clean- she sleeps 5 comfortably and there is the option of a 6th child’s berth in the saloon. The cockpit is safe and secure, with solid combings around the decks and a 1.3m draft she is the perfect safe family cruising vessel for NZ waters. She was antifouled in December 2024 and is all ready to go for your next adventure. Please contact our vendors Agent, Ashleigh, on 0273263486 or email her\nashleigh@parkermarinegroup.co.nz\nBoatCode: PEG-AM"
  },
  {
    "title": "2002 Bavaria 44",
    "ok": false,
    "info": "boatName: 2002 Bavaria 44\nLocation: Auckland\nBroker: Mike Parker\nLong Description: The original price tag of the Bavaria 44 allowed would-be owners to buy a new yacht for the same price as a secondhand boat of the same length – but does the Bavaria ethos of producing boats with masses of accommodation at a very competitive price point suit the average cruising sailor? Would such a yachtsman be well advised to buy a 22-year-old Bavaria 44? We think the answer is YES!!\nAndiamo is in remarkably good condition for her age, and overall, she is standing up to the years exceptionally well.\nThese boats were built with Kevlar reinforced hulls and layers of tough S-glass to take the forces of accidental grounding.\nThey are a strong and very capable offshore vessel and Andiamois no exception.\nHer Hobsonville marina berth is also available to purchase if required.\nContact the vendor’s sole agent Mike Parker to view this vessel. Phone: +64 275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: BAV44-MP"
  },
  {
    "title": "2005 Luhrs 36 Convertible",
    "ok": false,
    "info": "boatName: 2005 Luhrs 36 Convertible\nLocation: Auckland\nBroker: Flynn Hart\nLong Description: The Luhrs 36 Convertible, produced in 2005, is a sportfishing legend, known for its durability, performance, and comfortable accommodations.\nThe hull design of the Luhrs 36 is crafted for stability and seaworthiness, making it suitable for offshore fishing and cruising.\nThe cockpit is spacious and designed with fishing in mind.\nThe flybridge provides excellent visibility for the captain and has additional seating for passengers.\nThe interior salon is designed for comfort and relaxation.\nPowered by twin 440hp Yanmar 6LY2A-STP engines, providing ample power and fuel efficiency for cruising and fishing activities. Overall, the Luhrs 36 Convertible offers a balance of performance, comfort, and functionality, making it a popular choice among anglers and boating enthusiasts alike.\nContact Flynn Hart on 02108594195 or email flynn@parkermarinegroup.co.nz\nBoatCode: LC36-FH"
  },
  {
    "title": "2008 Jeanneau 36i",
    "ok": false,
    "info": "boatName: 2008 Jeanneau 36i\nLocation: Auckland\nBroker: Flynn Hart\nLong Description: When it comes to production boatbuilding, no one on the current manufacturing tableau does it any better than the French builder Jeanneau, and the proof of that statement is very much in evidence with the Sun Odyssey 36i. The “i” stands for injection molding, the process-in which resin is injected under pressure through closed molds-that the company employs for the 36i’s balsa-cored decks as well as for other components. It makes for lighter, stronger structures and cleaner, more environmentally friendly factories. The hull itself is hand-laid fiberglass utilizing two layers of vinylester resin, to which an internal fiberglass grid-Jeanneau calls this its “3rd Generation Hull Structure”-is glued and laminated for strength and rigidity. All this would be rendered moot if the design itself didn’t meet a certain level of performance and aesthetics, but French naval architect Marc Lombard, who made his name with sleek and powerful offshore raceboats, conceived the 36i, and he’s delivered a boat that looks smart and modern and sails very well. In profile, the boat is clearly a member of the extended Sun Odyssey family: With its fractional rig, gentle sheer, and low-slung coach roof, it’s a classic example of a contemporary performance cruiser. Contact Flynn Hart on 02108594195 or email flynn@parkermarinegroup.co.nz \nBoatCode: K@W-FH"
  },
  {
    "title": "2014 Pelin Thresher-Sedan",
    "ok": false,
    "info": "boatName: 2014 Pelin Thresher-Sedan\nLocation: Wellington\nBroker: Aaron Bilham\nLong Description: ZARA is an 11m Pelin Thresher and she is just 8 years old with an excellent finish inside & out.\nDue to her owners’ circumstances, everything on board is brand new and unused.\nVery economical boat to operate using just 12 to 15 litres per hour at 13 knots to 17.1 knots max.\nA beautifully laid out interior which is comfortable and easy care.\nPowered by a 220hp Cummins Diesel with only 165 hours use, this vessel is an absolute MUST VIEW\nContact the vendors Sole Agent, Aaron Bilham on 0224245426 or email aaron@parkermarinegroup.co.nz\nBoatCode: ZARA-AB"
  },
  {
    "title": "2018 Ron Given Econocat",
    "ok": false,
    "info": "boatName: 2018 Ron Given Econocat\nLocation: Whangarei\nBroker: Mike Parker\nLong Description: Quote from the builder, Craig Partridge: “I didn’t want a planing boat, and I didn’t want outboards, so Ron and I got together and came up with this concept. I wanted something cheap to run, big and comfortable and really good in a sea way – a good sea boat.” Kerikeri’s Craig Partridge partnered with multihull legend Ron Given to create this 10.8m powercat which delivered exactly what he needed to enjoy some well-earned leisure time. Partridge and Given joined forces on the project after delivering a Given-designed T11 powercat to New Caledonia in 2010. The pair took just two days and 18 hours to deliver the 12m cat 936 miles to Noumea. This got them talking about fuel-efficient, moderate-speed displacement powercats and led to the genesis of this boat, Kismet. The hull shape of Kismet had its genesis in another Given powercat, a 12m design launched in 2003. This boat combined an efficient hull form with moderate horsepower to produce a comfortable, fuel-efficient displacement cruiser with a reasonable turn of speed. “The concept was a highly efficient boat that performs well in all sea conditions,” says Given. A displacement boat that is highly economical.” Kismet is the result. A stunning, comfortable, easily driven powercat with room to spare. Contact our Vendors Sole Agent, Mike, on +64275504140 or email mike@parkermarinegroup.co.nz\nBoatCode: RGEcono-MP"
  },
  {
    "title": "2021 Beautiful 11m Powercat",
    "ok": false,
    "info": "boatName: 2021 Beautiful 11m Powercat\nLocation: Auckland\nBroker: Ed Griffin\nLong Description: Way Maker is an 11m Dibley designed Powercat, built by Malcolm Steedman, and Allan Obrien Boat Builders.\nShe was changed from a sailing cat to a power cat in 2021 and has twin 135hp Honda outboards with only 16 hours running time on them. They are due for their first service shortly. Way Maker is a fantastic fishing platform with a beam of 4.85m and with the outboards placed at her extremities, this makes her incredibly maneuverable. She also has a wonderful trampoline forward, which makes for perfect sunbathing and Dolphin watching. Way Maker is a very special vessel, and she has been built to ensure best design and practicality are fused seamlessly together. If you love Powercats and the room they provide, then you MUST view Way Maker. Contact Mike on 0210792235 or email ed@nzmarinedistribution.co.nz\nBoatCode: DPC-EG"
  },
  {
    "title": "38ft Breekvelt",
    "ok": false,
    "info": "boatName: 38ft Breekvelt\nLocation: Whangarei\nBroker: Mike Parker\nLong Description: 35ft (38’ O.A),\nCentre cockpit,\n5mm Corten Steel hull and topside with ply cabin,\nSleeps 6.\nReconditioned 3cyl, Isuzu 37hp diesel, approximately 400hrs,\nEngine serviced every 100 hrs.\nThis is a clean dry and very tidy boat with no expense spared on rebuild/refit including.\nTotal strip of boat, sandblast, and professional paint system inside and out.\nEverything is new.\nElectrical wiring,\nCircuit board\nIsolation switches,\n1800w inverter,\nRaymarine touchscreen chartplotter/fishfinder at steering helm,\nRaymarine auto pilot,\nfridge,\n3 burner cook top.\nKauri joinery and trim,\nFormica benchtops,\nNew head,\nShower (H&C) and Sinks,\nDeck shower H&C.\nNew rigging,\nRebuilt and painted mast and boom,\nreconditioned sail winches x 3,\nNew deck winch with 3 remotes,\n80m x 8mm chain and anchor.\nRecovered squabs and mattresses and cockpit cushions (seats 6),\nKiwi sizzler bbq slides out and then stows away in large volume lazzerette.\nLots of storage spaces,\n380 litres water in new tanks,\nNew fresh and saltwater pumps,\nTV/DVD,\nPioneer BT stereo,\nEpirb,\n2 new life jackets.\nBoatCode: BV-MP"
  },
  {
    "title": "40ft Alan Mummery Ketch",
    "ok": false,
    "info": "boatName: 40ft Alan Mummery Ketch\nLocation: Picton\nBroker: Dave Radford\nLong Description: Professionally built by Sinclair Melbourne in Lyttelton in 1975 by true craftsmen. Triple skin kauri, fibre glassed over hull and cabins from new, teak decks, center cockpit with aft cabin, 7 berth. 72HP Perkins diesel, new shaft and prop. Recently anti fouled and masts out and rigging checked and replaced as necessary.  Furlex roller head sail, main and mizzen staysil and mizzen. I purchased Arohanui  from the original owner in 1981. It has been looked after and well maintained. Excellent sea boat and sails very well. This yacht is a beautiful looking classic and a pleasure to own. Located in Picton\nBoatCode: MUM-DR"
  },
  {
    "title": "40ft Pelin Patrol",
    "ok": false,
    "info": "boatName: 40ft Pelin Patrol\nLocation: Taupo\nBroker: Aaron Bilham\nLong Description: The Pelin Patrol is one of Frank Pelins favourite designs and when you see this one, which has added beam, you will know why. Built strongly in Aluminium by an engineer, she is robust to say the least, yet she still cruises at speed through the water, no matter the conditions. Contact Aaron on 0224245426 or email aaron@parkermarinegroup.co.nz\nBoatCode: Code PP-AB"
  },
  {
    "title": "Beautiful Classic Trawler",
    "ok": false,
    "info": "boatName: Beautiful Classic Trawler\nLocation: Kerikeri\nBroker: Mike Parker\nLong Description: Santa Maria was built in 1955 and was used for fishing Hapuka and Crayfish in Cook Strait. Subsequently she has worked in various roles all over New Zealand. She is very well maintained by her current owners, and she is a real credit to them. This is one of New Zealand’s classic icons, and to top this off, she is a fantastic seagoing vessel.\nSanta Maria was professionally converted approximately 20 years ago, and to this day, she is a much-admired piece of New Zealand’s Maritime History. She was last antifouled in November 2022.\nHer aft cockpit area is huge, and with Walk-around decks it makes her a dream boat to be aboard.\nPowered by the Rolls Royce of Diesel engines, a 127hp Gardiner, she cruises easily at 8knots. Approx 6ltrs/Hour\nBoatCode: SM-MP"
  },
  {
    "title": "Farr 30/Farr 9.2",
    "ok": false,
    "info": "boatName: Farr 30/Farr 9.2\nLocation: Auckland\nBroker: Flynn Hart\nLong Description: PRICE REDUCED FOR QUICK SALE.\nDesign #86 from the drawing board of renowned designer Bruce Farr is the Farr 30/Farr 9.2.\nThis design was conceived following several requests for a good all-round safe, economical, fast cruising yacht of 30 ft overall length. There were requests for a fixed keel boat and also a lift keel boat that could be trailered, and for this reason the beam was kept below 9 ft 6 in to allow semi-permanent over width trailering permits.\nThis produced a yacht with a moderate beam/length ratio which guarantees very fast speed and easy handling reaching and downwind. Upwind performance and initial stability at rest is provided by the ballast being set very low in the lift keel version and firm bilges which gives the boat a great deal more stability than its ballast and displacement figures would suggest. However, this fixed keel version carries a higher ballast ratio with the lead still located low down in the shallower keel and has similar stability to the lift keel version. This design will fill a great number of individual needs as well as being an excellent all-purpose yacht, and is one that will develop well into a class or club racing yacht, providing exceptional interior accommodation per dollar spent, a stable, safe family yacht, as well as a very high performance potential for those people who see no reason for a cruising yacht not to be very fast and/or wish to race their yacht in one-design or club races.\nBoatCode: Farr 9.2"
  },
  {
    "title": "Logan 27ft Gaff Rigger",
    "ok": false,
    "info": "boatName: Logan 27ft Gaff Rigger\nLocation: Warkworth\nBroker: Flynn Hart\nLong Description: This boat was built by the Logan brothers in Auckland. She’s a 25ft Kauri Carvel design that was custom built for the foster family of Kiriti Bay just south of Coromandel township. She was launched as the Avon, that translates to the little river in old English. 1908 was built as a sistership to the Rewa that is exhibited at the Auckland Maritime Museum. Both boats are considered Coastal Trader boats. Before the construction of roads, goods were transported on water to ports and harbours around the coastline. The Foster family used it to carry the family to Auckland, often accompanying the much larger vessel Rewa that carried bales of wool for the Auckland markets. She has a solid keel and was built in the style of the famous Auckland mullet boats. In the 90’s the cabin was replaced, providing more space and comfort. More recently, in 2021, the inboard was replaced by a new Honda 10hp outboard. This allowed the cabin to be reconfigured and now boasts comfortable twin bunks. She is gaff rigged and comes with 3 sails.\nBoatCode: 1908-FH"
  },
  {
    "title": "Markline 900",
    "ok": false,
    "info": "boatName: Markline 900\nLocation: Auckland\nBroker: Ian Duncan\nLong Description: Tidy Markline 900, launched 1986 and continuously well maintained. Recent work by current owners: Stern leg rebuild in Dec 2023, New antifoul Dec 2023, Exhaust manifold to leg section replaced 2024, Full service and drive pressure tested 2024. Receipts for recent engine and drive services plus survey report from Jan 2022. New house batteries Jan 2024. Original galley freezer is still in place and is now used as an ice cool box (Engine compressor removed), also 12v fridge with freezer box. Carpets and upholstery in good condition. large duckboard with Stainless hoop, bait board, and Takacat dinghy. Full flybridge and cockpit canopies for year-round boating. Fantastic Markline features like the salon pullman berth and convertible dinette provide comfortable sleeping for 6 plus the covered flybridge loungers could handle a couple of youngsters. This launch is offered as a package with her Westhaven berth. This berth is coming to the end of its lease in September 2026. The vendors have calculated its value as a run down to zero at this date. Boat and berth $88,000. Boat only $73,000. On going rental/lease from vendor $1,000 P/Month up to Sept 2026. Contact our vendor’s sole agent, Ian Duncan: Txt/WhatsApp/call 021 121 9524 Email ian@parkermarinegroup.co.nz\nBoatCode: NAUTI-ID"
  },
  {
    "title": "Pelin Apollo",
    "ok": false,
    "info": "boatName: Pelin Apollo\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: Information is scarce on this vessel, so interested parties will need to inspect to determine the offering.\nPlease contact the vendors sole agent: Paul Oldham on 0274991028 or email\nBoatCode: TOA-PO"
  },
  {
    "title": "Pelin Sterling 26",
    "ok": false,
    "info": "boatName: Pelin Sterling 26\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: 26ft fibreglass Pelin Sterling and swing mooring combo in Whangamata. Contact Paul Oldham on 0274991028 or email paul.o@parkermarinegroup.co.nz\nBoatCode: STER-PO"
  },
  {
    "title": "Vagabond 47",
    "ok": false,
    "info": "boatName: Vagabond 47\nLocation: Bay of Islands\nBroker: Josh Weeks\nLong Description: If you’ve seen Pirates of the Caribbean, and you like parrots, you are likely to be just the sort of person who will appreciate the Vagabond 47. This is undoubtedly one of the saltiest examples of a sailing yacht of this size. This is an affordable “big” cruising boat that continues to enjoy a great deal of popularity among long-term cruisers.\nThe Vagabond 47 was designed by William Garden, master of the raised quarter deck, which gives this design her salty appearance.\nBoatCode: Vaga 47-JW"
  },
  {
    "title": "Wade 36 Flybridge",
    "ok": false,
    "info": "boatName: Wade 36 Flybridge\nLocation: Warkworth\nBroker: Mike Parker\nLong Description: This vessel is believed to be a Dave Wade design and she was built by Neville Noyer. She has a beam of 3.2m and a draft of just .8m. Powered by a reliable 210hp Hino diesel engine coupled to a robust Hurst transmission. This vessel is ready to go, so give Mike a call on 0275504140 or email mike@parkermarinegroup.co.nz \nBoatCode: Loaf36-MP"
  },
  {
    "title": "Whangamata Marina Berth",
    "ok": false,
    "info": "boatName: Whangamata Marina Berth\nLocation: Whangamata\nBroker: Paul Oldham\nLong Description: Situated inside the Whangamata harbour, in a very sheltered and secure location, the marina provides unparalleled access to wonderful offshore gamefishing and recreational fishing and cruising grounds triangulated by Mayor Island, The Alderman Islands and Slipper Island to the North. Protected by a solid rock breakwater on three sides, the 209 berths range from 10.5m to 20m in length.\nThe berths are designed with full length fingers; two intermediate piles; generous fairways; power and water supply via individual power modules. There is a 24 hour fuel jetty supplying GOfuel diesel, sewage pump-out facilities; evening security patrols; and plenty of free car parking for berth owners and visitors.\nA friendly, professional management team operates out of the Marina Office, providing management, information, maintenance and security services to the berths and marina facilities.\nBoatCode: WH16m"
  }
]